Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_PlaygroundBookFormatRef/PlaygroundBookFormatReference-level2.tmx
Source language: en_us
Languages: ja

source: Display a live view by setting liveView to an object that conforms to the PlaygroundLiveViewable Protocol.
ja: liveViewをPlaygroundLiveViewable Protocolプロトコルに準拠するオブジェクトに設定することによって、あるライブビューを表示してください。

source: Display and dismiss live views
ja: ライブビューを表示する、片付ける

source: Display and manipulate PDF documents in your applications..
ja: PDF書類をあなたのアプリケーションにおいて表示および手を加えます。

source: Display map or satellite imagery from the windows and views of your custom apps.
ja: 地図と衛星画像をウインドウおよびあなたのカスタムアプリのビューから表示します。

source: Display view-based previews of documents and images that are in uncommon formats or in formats that you don’t handle.
ja: ドキュメントおよびイメージのビューに基づくプレビューを表示します、それは一般的でない形式においてまたはあなたが取り扱えない形式においてです。

source: Display web content in windows.
ja: ウェブコンテンツをウインドウにおいて表示します。

source: Displays an icon indicating that the specified peripheral is available but may not be usable.
ja: 指定の周辺機器が利用可能であるが使用できないかもしれないことを示すアイコンを表示します。

source: Displays an icon representing the specified peripheral.
ja: 指定の周辺機器を表しているアイコンを表示します。

source: Displays the battery level for the specified peripheral.
ja: 指定の周辺機器のバッテリーレベルを表示します。

source: Displays the name of the specified peripheral.
ja: 指定の周辺機器の名前を表示します。

source: Displays whether or not the specified peripheral’s firmware is up-to-date.
ja: 指定の周辺機器のファームウェアが最新かどうかを表示します。

source: Document Revision History
ja: 文書改訂履歴

source: Each book in your subscription should be represented in your feed’s documents array by an object that has the fields listed below.
ja: あなたのサブスクリプションの中のそれぞれのブックは、あなたのフィードのdocuments配列の中で、下で一覧にされるフィールドを持つあるオブジェクトによって表されなければなりません。

source: Each delimiter is followed by an asterisk and a forward slash (*/).
ja: 各区切り記号は、アスタリスクとフォワードスラッシュ（*/）が後に続きます。

source: Each dictionary in the Terms dictionary describes a glossary term.
ja: Termsディクショナリの中の各ディクショナリは、１つのグロッサリー用語を記述します。

source: Each entry in the array contains the name and extension of a folder in the Chapters folder of the book package.
ja: 配列の各登録項目は、ブックパッケージのChaptersフォルダの中のあるフォルダの名前と拡張子を含んでいます。

source: Each entry in the array contains the name and extension of a folder in the Pages folder for a chapter.
ja: 配列の中の登録項目それぞれは、ある章のためのPagesフォルダの中のあるフォルダの名前と拡張子を含みます。

source: Each hint displays either text in the property list or the contents of a referenced file key.
ja: 各ヒントは、プロパティリストの中のテキストか、参照されたファイルキーの内容のどちらかを表示します。

source: Each hint is represented by a dictionary in the array.
ja: 各ヒントは、配列の中の１つのディクショナリによって表されます。

source: Each term dictionary contains the definition of the term and an optional dictionary defining a link to the first use of the term.
ja: 各用語ディクショナリは、用語の定義と、用語の「使い始め」へのリンクを定義している任意のディクショナリを１つ含みます。

source: Editable Areas
ja: 編集エリア

source: Enable web-based views and services in your playground book.
ja: ウェブに基づくビューとサービスをあなたのプレイグラウンドブックにおいて可能にします。

source: Encode a dictionary of PlaygroundValue values for the key-value store or for live view messaging.
ja: キー値保管庫のためのまたはライブビューメッセージ送信のための、PlaygroundValue値のディクショナリをエンコードします。

source: Encode an array of PlaygroundValue types for the key-value store or for live view messaging.
ja: キー値保管庫のためのまたはライブビューメッセージ送信のための、PlaygroundValue型の配列をエンコードします。

source: Enumeration Cases
ja: Enumerationケース節

source: Executing the playground without setting a value for the end of the range results in an error.
ja: この範囲の終わりに対して値を設定することなくプレイグラウンドを実行すると、エラーという結果になります。

source: Expand further on the name of the book to provide additional context.
ja: ブックの名前をさらに詳しく述べることで追加の内容を提供します。

source: Expand on the name of the book to provide additional context.
ja: ブックの名前を詳しく述べることで追加の内容を提供します。

source: Extension
ja: 拡張子

source: Feeds in Swift Playgrounds are structured in a text format called JSON.
ja: Swift Playgroundsにおけるフィードは、JSONと呼ばれるテキスト形式の構造をもちます。

source: Feeds of JSON are informally defined by two characteristics:
ja: JSONのフィードは、２つの特徴によって略式に定義されます。

source: Fetch and cache full-sized assets or thumbnails asynchronously, revise content, and sync revisions to multiple devices.
ja: フルサイズのアセットまたはサムネイルを非同期に取得およびキャッシュして、コンテンツをリサイズし、そして複数デバイスで改訂を同期します。

source: Field
ja: フィールド

source: Fields use two types of optional placeholders to indicate areas where the user can enter code.
ja: フィールドは２つの種類の任意のプレースホルダーを使うことで、ユーザがコードを入力できるエリアを指し示します。

source: File name
ja: ファイル名

source: FileReference Key
ja: FileReferenceキー

source: Find and play user-installed media items including songs, audio podcasts, and audio books.
ja: ユーザがインストールしたメディアアイテムを、歌、オーディオ、ポッドキャスト、そしてオーディオブックを含めて、見つけて再生します。

source: FirstUse Key
ja: FirstUseキー

source: Folder Name Extensions
ja: フォルダ名拡張子

source: Folder name
ja: フォルダ名

source: Folders in the Package Structure
ja: パッケージ構造の中のフォルダ

source: For a list of possible namespaces, see Table 11-1.
ja: 可能な名前空間のリストとして、表 11-1を見てください。

source: For an example of a JSON object that follows this format, see An Example Subscription Feed.
ja: この書式に従うJSONオブジェクトの例として、サブスクリプションフィードの例を見てください。

source: For detailed information about the feed format, see Subscription Feed Format.
ja: フィード書式についての詳細情報として、サブスクリプションフィード書式を見てください。

source: For each entry, the PageReference Key should be set to the file reference path using the folder and file name, rather than the name found in Manifest.plist.
ja: 各登録項目に対して、PageReference Keyはフォルダとファイル名を使っているファイル参照パスに設定されるべきです、Manifest.plistで見つけられる名前ではなくて。

source: For example, a playground page with the //:#localized(key: "FirstProseBlock") comment marker may contain an en.lproj folder in the PrivateResources folder containing the following Prose.strings file:
ja: 例えば、あるプレイグラウンドページで//:#localized(key: "FirstProseBlock")コメントマーカーを持つものは、en.lprojフォルダをPrivateResourcesフォルダの中に含んで、以下のProse.stringsファイルを含んでいるかもしれません：

source: For example, a playground that presents a simplified user interface programming environment can make its view-like type conform to PlaygroundLiveViewable and appear in the live view.
ja: 例えば、単純なインターフェイスプログラミング環境を提示するプレイグラウンドは、それのビューのような型をPlaygroundLiveViewableに準拠するようにしてライブビューの中に現れるようにします。

source: For example, code in the Sources folder at the book level is available to all chapters and pages, whereas code in the Sources folder at the chapter level is available to all pages in that chapter but not to any other chapter.
ja: 例えば、ブックレベルでのSourcesフォルダの中のコードは、全ての章とページで利用可能です、それに対して章レベルでのSourcesフォルダの中のコードは、その章の中の全てのページで利用可能です、しかし何であれ他の章にはそうでありません。

source: For example, on the page shown in Figure 7-3, the only editable area is surrounded by a red box.
ja: 例えば、図 7-3で示されるページでは、ただ１つの編集エリアが赤いボックスで囲まれます。

source: For example, resources for English-speaking users go in en.lproj folders, and resources for French-speaking users go in fr.lproj folders.
ja: 例えば、英語を話すユーザのためのリソースはen.lprojフォルダにしまいます、そしてフランス語を話すユーザのためのリソースはfr.lprojフォルダにしまいます。

source: For example, the central manager is in an invalid state for connections when it’s powered off.
ja: 例えば、セントラルマネージャはそれが電源を切られる場合に接続に対して無効な状態にあります。

source: For example, the following multiline editable area is invalid:
ja: 例えば、以下の複数行編集エリアは無効です：

source: For example, the page shown in Figure 6-1 appears to contain only the placeholder text “Tap to enter code.”
ja: 例えば、図 6-1 で示されるページは、プレースホルダーテキスト「Tap to enter code」のみを含むよう見えます。

source: For example, the typed placeholder defined on line 3 of Listing 9-1 specifies an Int; selecting the placeholder opens the number-entry popover as shown in Figure 9-1.
ja: 例えば、コード出力 9-1の行３で定義される型指定されたプレースホルダーは、Intを指定します；そのプレースホルダーを選択すると、図 9-1で示されるように数値入力ポップオーバーが開きます。

source: For example, to show the success text “You did it!” set the assessment status to .pass, as shown below.
ja: 例えば、結果成功テキスト「You did it!」を表示するには評価状態を.passに設定してください、下に示すように。

source: For example, you can supply the following locale JSON to support a feed that’s localized to contain English and French versions of a subscription’s content:
ja: 例えば、あなたは以下のロケールJSONを提供してあるフィードをサポートできます、それはサブスクリプションの内容の英語およびフランス語バージョンを含むように現地語化されます。

source: For example: https://example.com/whimsical-swift/feed.json.
ja: 例えば：https://example.com/whimsical-swift/feed.json。

source: For more information about JSON, see ECMA-404: The JSON Data Interchange Format.
ja: JSONについてのさらなる情報として、ECMA-404: The JSON Data Interchange Formatを見てください。

source: For more information about interfacing with Bluetooth peripherals, see Core Bluetooth Programming Guide and Core Bluetooth framework documentation.
ja: Bluetooth周辺機器とのインターフェイスについての更なる情報として、Core Bluetooth Programming GuideとCore Bluetoothフレームワーク文書を見てください。

source: For more information about localizing feeds, see Localizing a Feed.
ja: フィードの現地語化についてのさらなる情報として、フィードの現地語化を見てください。

source: For more information on LiveViewEdgeToEdge, see LiveViewEdgeToEdge Key.
ja: LiveViewEdgeToEdgeに関する詳細として、LiveViewEdgeToEdgeキーを見てください。

source: For more information on markup, see Markup Formatting Reference.
ja: マークアップに関するさらなる情報として、Markup Formatting Referenceを見てください。

source: For more information on multiple resolutions, see Loading Image Resources in Resource Programming Guide.
ja: 複数の解像度に関するさらなる情報として、Loading Image ResourcesをResource Programming Guideで見てください。

source: For more information, see "Characters" in RFC 3986.
ja: さらなる情報として、"Characters"をRFC 3986で見てください。

source: For more information, see Language IDs and CFBundleDevelopmentRegion.
ja: さらなる情報として、Language IDsとCFBundleDevelopmentRegionを見てください。

source: For more information, see Language and Locale IDs in Internationalization and Localization Guide.
ja: 詳細は、Language and Locale IDsをInternationalization and Localization Guideで見てください。

source: For more information, see String Resources in Resource Programming Guide, and Internationalization and Localization Guide.
ja: 詳細は、String ResourcesをResource Programming Guideで、そしてInternationalization and Localization Guideを見てください。

source: For more information, see Markup Formatting Reference.
ja: 詳細は、Markup Formatting Referenceを見てください。

source: For more information, see Name Key in Playground Page Manifest.
ja: さらなる情報として、Nameキーをプレイグラウンドページマニフェストで見てください。

source: For more information, see CodeCopySetup Key.
ja: 詳細は、CodeCopySetupキーを見てください。

source: For more information, see Read-Only Page Content.
ja: さらなる情報として、読み出し専用ページコンテンツを見てください。

source: For more information, see Name Key in Chapter Manifest.
ja: さらなる情報として、Nameキーを章マニフェストで見てください。

source: For more information, see PlaygroundRemoteLiveViewProxy Class.
ja: 詳細として、PlaygroundRemoteLiveViewProxyクラスを見てください。

source: For possible values, see AssessmentStatus Enumeration.
ja: 可能な値のために、AssessmentStatus列挙を見てください。

source: Functionality includes displaying a live view, accessing the text in the playground, checking the assessment status, ending the execution of a playground, and accessing the live view.
ja: 機能性は、ライブビューの表示、プレイグラウンドの中のテキストへのアクセス、評価状態の確認、プレイグラウンド実行の終了、そしてライブビューへのアクセスを含みます。

source: Get fine-grained access to the GPU while minimizing CPU overhead.
ja: GPUへのきめの細かいアクセスを得る一方でCPUオーバーヘッドを最小限にします。

source: Glossary
ja: グロッサリー

source: Glossary Property List
ja: グロッサリープロパティリスト

source: Handle path-based drawing, anti-aliased rendering, gradients, images, color management, PDF document handling, and more.
ja: パスに基づく描画、アンチエイリアスでのレンダリング、傾斜、画像、色の管理、PDFドキュメント処理、その他いろいろを取り扱います。

source: Harness the power of Quartz technology to perform lightweight 2D rendering with high-fidelity output.
ja: Quartzテクノロジーのパワーを動力として高い正確性の結果出力で軽量2Dレンダリングを実行します。

source: Help users access and manage their external accounts from within your playground book, without requiring them to enter their login credentials.
ja: ユーザが彼らの外部アカウントにログイン認証情報の入力を必要とすることなく、あなたのプレイグラウンドブック内部からアクセスして管理するのを助けます。

source: Hidden Code
ja: 非表示コード

source: Hidden code is executed when the playground is run and all of the public symbols are accessible on the playground page.
ja: 非表示コードは、プレイグラウンドが実行されて、全てのパブリックシンボルがプレイグラウンドページ上で利用可能である時に遂行されます。

source: Hidden code is placed between the hidden-code and end-hidden-code delimiters.
ja: 非表示コードは、hidden-codeとend-hidden-code区切り記号の間に置かれます。

source: Hides the live view until the playground is run.
ja: プレイグラウンドが実行されるまでライブビューを隠す。

source: Hints Property List
ja: ヒントプロパティリスト

source: Hints are formatted using markup, and no special comment delimiters are required.
ja: ヒントはマークアップを使って書式設定され、特別なコメント区切り記号は必要とされません。

source: Hints are shown in a popover, in the same order in which they occur in the array.
ja: ヒントはポップオーバーにおいて、それらが配列に現れるのと同じ順序で、表示されます。

source: Hints can include a spoiler button that the user taps to see the hint text, as shown in Figure 15-2.
ja: ヒントはスポイラーボタンを含むことができ、ユーザがタップすることでヒントテキストを見ます、図 15-2で示すように。

source: Hosts have their own terms and conditions, however, and may charge fees for high download volumes.
ja: それらホストは、しかしながら独自の用語と条件を持ち、高いダウンロード容量に対して料金を求めるでしょう。

source: However, the host must support TLS 1.3 encryption.
ja: しかしながら、ホストはTLS 1.3暗号化をサポートしなければなりません。

source: If nil, all peripherals in range are eligible for connection attempts.
ja: nilならば、範囲内のすべての周辺機器が接続を試みる対象となります。

source: If true, the central manager attempts to reconnect to it.
ja: trueならば、セントラルマネージャはそれに再接続を試みます。

source: If a page has a resource with the same name as its containing chapter, or a chapter has a resource with the same name as its containing book, the resource associated with the higher level is used.
ja: あるページがそれを含んでいる章と同じ名前どリソースを持つ、またはある章がそれを含んでいるブックと同じ名前でリソースを持つならば、より高いレベルと結び付けられたリソースが使われます。

source: If a page, chapter, or book has a resource with the same name in both the PublicResources and the PrivateResources folders, the resource in the PublicResources folder is used.
ja: ページ、章、またはブックがPublicResourcesとPrivateResourcesフォルダとの両方において同じ名前でリソースを持つならば、PublicResourcesフォルダのリソースが使われます。

source: If it does, a success dialog is presented.
ja: それがそうするならば、成功結果ダイアログが提示されます。

source: If necessary, customize the default system behavior that you implement with AVKit.
ja: 必要ならば、あなたがAVKitを使って実装する初期状態のシステム挙動をカスタマイズしてください。

source: If no solution is provided, there must be at least one string in the hints array.
ja: 解答が提供されないならば、少なくとも１つの文字列がhints配列の中になければなりません。

source: If no value is specified, this defaults to “Copy my code”.
ja: 値が指定されないならば、これは初期状態で「Copy my code」になります。

source: If no value is specified, this defaults to “Go to <PREVIOUS_PAGE>”, where <PREVIOUS_PAGE> is substituted for the name of the previous page.
ja: 値が指定されないならば、これは初期状態で「Go to <PREVIOUS_PAGE>」になります、ここで<PREVIOUS_PAGE>は以前のページの名前の代わりにされます。

source: If no value is specified, this defaults to “Start with provided code”.
ja: 値が指定されないならば、これは初期状態で「Start with provided code」になります。

source: If not specified, the term name key is used.
ja: 指定されないならば、用語名キーが使われます。

source: If the feed is out of date, there may be a mismatch between the preview information contained in the feed and the content in the playground books the feed links to.
ja: フィードが古いものならば、フィードに含まれるプレビュー情報とフィードがリンクするプレイグラウンドブックの内容の間に食い違いが生じます。

source: If the timeout value is nil, the attempt won’t time out.
ja: timeout値がnilならば、その試みは中断しません。

source: If unspecified, 1.2 is used.
ja: 指定されないならば、1.2が使われます。

source: If unspecified, 3.1 is used.
ja: 指定されないならば、3.1が使われます。

source: If you have an existing personal, business, or school website, you can add a page to that site linking visitors to your Swift Playgrounds subscriptions.
ja: あなたが既存の個人の、ビジネスの、または学校のウェブサイトを持つならば、あなたはそのサイトにページを追加して、訪問者をあなたのSwift Playgroundsサブスクリプションと結びつけることができます。

source: If you want to distribute your playground in a classroom or workshop environment, you can instruct learners to enter the URL of your feed manually.
ja: あなたがあなたのプレイグラウンドを教室またはワークショップ環境で配布したいならば、あなたは学習者をあなたのフィードのURLを手動で入力するように指示することができます。

source: If you're writing episodic content in your Swift Playgrounds learning material, or want to space out the releases of your lessons over time, you can build a subscription that guides people through your lessons one by one.
ja: あなたがSwift Playgrounds学習素材の中で挿話的なコンテンツを書いている、または時間を置いてあなたのレッスンのリリースの間隔を空けたいならば、あなたはサブスクリプション（定期購読、配信）を構築して、人々にあなたのレッスンを１つずつ案内できます。

source: If your playground book uses APIs specific to Swift Playgrounds, or if you need to debug a page’s live view, download the Swift Playgrounds Author Template from Downloads for Apple Developers.
ja: あなたのプレイグラウンドブックがSwift Playgroundsに特有なAPIを使うならば、またはあなたがあるページの持つライブビューをデバッグする必要があるならば、Swift Playgrounds Author TemplateをDownloads for Apple Developersからダウンロードしてください。

source: ImageReference Key
ja: ImageReferenceキー

source: Implement browser features such as following user-activated links, managing a back-forward list, and managing a history of recently visited pages.
ja: ブラウザ機能、例えばユーザが作動させたリンクの追跡、バックワードリストの管理、そして最近訪れたページの履歴の管理を実装します。

source: Implement internationalization easily and consistently across all programming interfaces.
ja: すべてのプログラミングインターフェイスに渡って簡単に首尾一貫して国際化を実装します。

source: Implement this protocol only for custom objects that do not inherit from UIView or UIViewController.
ja: このプロトコルをUIViewまたはUIViewControllerから継承しないカスタムオブジェクトのためにだけ実装してください。

source: Import, export, and manipulate 3D models using a common infrastructure that integrates MetalKit, GLKit, and SceneKit.
ja: をMetalKit、GLKit、そしてSceneKitを統合する共通インフラストラクチャを使って、3Dモデルインポート、エクスポート、および操作します。

source: Important
ja: 重要

source: In Figure 3-2, First Chapter is used as the name of the chapter in the table of contents.
ja: 図 3-2では、First Chapterは目次における章の名前として使われます。

source: In Figure 4-1, Introduction is used as the name of the cutscene page in the table of contents.
ja: 図 4-1では、Introductionは目次におけるカットシーンの名前として使われます。

source: In Figure 5-3, Example Page is the name of the playground page in the table of contents.
ja: 図 5-3では、Example Pageは目次におけるプレイグラウンドページの名前です。

source: In Figure 5-5, Llama logo.png is used to show a Llama in the center of the live view area of the playground page.
ja: 図 5-5では、Llama logo.pngはプレイグラウンドページのライブビューエリアの中心でラマを表示します。

source: In First-use path, the first use of the term command is in the chapter Document1.playgroundchapter on the page Exercise1.playgroundpage.
ja: First-use pathにおいて、用語commandの最初の利用は、章Document1.playgroundchapterの中でのページExercise1.playgroundpage上においてです。

source: In Swift Playgrounds, press the "Add Subscription" button and enter the URL for your feed.
ja: Swift Playgroundsにおいて、"Add Subscription"ボタンを押してあなたのフィードのURLを入力してください。

source: In an edit area inserted after line 5, the set of possible completions is now moveForward(), collectGem(), toggleSwitch(), turnRight(), and for.
ja: 行５の後に挿入される編集エリアにおいて、可能な補完の一式は、現在moveForward()、collectGem()、toggleSwitch()、turnRight()、そしてforです。

source: In an edit area inserted between line 2 and line 3, the set of possible completions is moveForward(), turnLeft(), collectGem(), and toggleSwitch().
ja: 行２と３の間に挿入される編集エリアにおいて、可能な補完の一式はmoveForward()、turnLeft()、collectGem()、そしてtoggleSwitch()です。

source: Include this information in the PlaygroundBluetoothConnectionView.Item you create when it will help users pick a peripheral.
ja: この情報をあなたが作成するPlaygroundBluetoothConnectionView.Itemに含めて下さい、それがユーザが周辺機器を選ぶ助けになる場合は。

source: Including this key shows a spoiler button with the specified title in the popover instead of the hint.
ja: このキーを含むことで、ヒントではなくポップオーバーにおいて指定されたタイトルを持つスポイラーボタンが現れます。

source: Incorporate common gameplay behaviors using random number generation designed for games and infrastructure for implementing behavior entities.
ja: 一般的なゲームプレイ挙動を、ゲーム用に設計される乱数生成と挙動実在を実装するための基幹施設を使って取り入れます。

source: Incorporate design patterns and mechanisms that make your playground books more efficient and robust.
ja: あなたのプレイグラウンドブックをより効率的で強固なものにするデザインパターンとメカニズムを取り入れます。

source: Indicates that the user failed the task for the playground page and provides updated hints.
ja: ユーザがプレイグラウンドページの課題を失敗したことを指し示します、そして更新されたヒントを提供します。

source: Indicates that the user succeeded at the task for the playground page and provides a success message.
ja: ユーザがプレイグラウンドページの課題に成功したことを指し示して、合格メッセージを提供します。

source: Informs the delegate that the connection to the remote live view has been closed.
ja: 委任先にリモートライブビューへの接続が閉じられてしまっているのを告知します。

source: Informs the handler that it has connected to a remote object.
ja: ハンドラにそれがリモートオブジェクトに接続されたことを告知します。

source: Informs the handler that the connection between the proxy and the live view was closed.
ja: ハンドラにプロキシとライブビューの間の接続が閉じられたことを告知します。

source: Informs the handler that the connection between the proxy and the remote object was closed.
ja: ハンドラにプロキシとリモートオブジェクトの間の接続が閉じられてしまったことを告知します。

source: Initializers
ja: イニシャライザ

source: Inline Editable Areas
ja: インライン編集エリア

source: Inline editable code areas allow users to complete a single line of code.
ja: インライン編集コードエリアは、ユーザに単一行コードを完成させるようにします。

source: Instance Methods
ja: インスタンスメソッド

source: Instance Properties
ja: インスタンスプロパティ

source: Instead, playgrounds access these APIs by importing modules for header files located in the /usr/include directory.
ja: 代わりに、プレイグラウンドはこれらのAPIに/usr/includeディレクトリにあるヘッダファイルに対するモジュールをインポートすることによってアクセスします。

source: Instead, use the raw URL from your web host for the feed.
ja: そうではなく、フィードのためのあなたのウェブホストからの生のURLを使ってください。

source: Instructions for copying content between pages
ja: ページ間で内容をコピーするための説明書

source: Integrate iOS device camera and motion features to produce augmented reality experiences in your book.
ja: iOS装置のカメラとモーションを統合して、拡張現実体験をあなたのブックにおいて生み出します。

source: Integrate your playground book with supported social networking services.
ja: あなたのプレイグラウンドブックをサポートされるソーシャルネットワークサービスと統合します。

source: It automatically stores the ID of the most recently connected peripheral.
ja: それはごく最近接続した周辺機器のIDを自動的に保管します。

source: It consists primarily of lists, definition lists, and raw values like strings and numbers.
ja: それは主として幾つかのリスト、定義リスト、そして文字列や数値のような生の値から成ります。

source: It is set to true when liveView is set to a non-nil value.
ja: それがtrueに設定されるのは、liveViewが非nil値に設定される時です。

source: It then sets the "AnimalCounts" key in the playground book key-value store to the constructed array case.
ja: それはそれから、プレイグラウンドブックキー値保管庫の中の"AnimalCounts"キーを構築された配列ケース節に設定します。

source: It then sets the "AnimalCountDict" key in the playground book key-value store to the constructed dictionary case.
ja: それはそれから、プレイグラウンドブックキー値保管庫の中の"AnimalCountDict"キーを構築されたディクショナリケース節に設定します。

source: JSON is a textual data format that many apps and websites use to communicate and share information.
ja: JSONは、多くのアプリとウェブサイトが情報を伝達および共有するために使うテキストデータ書式です。

source: Key
ja: キー

source: Key List
ja: キーのリスト

source: Key and value strings are separated by an equal sign (=), and the entire entry must be terminated with a semicolon character (;).
ja: キーおよび値文字列は、等号（=）で分けられ、そして登録項目全体はセミコロン文字（;）で終わらなければなりません。

source: Level
ja: 階層

source: Like podcasts, subscriptions in Swift Playgrounds are a sequence of episodic content learners go through in an order that builds knowledge, though some parts may be skippable depending on the learner.
ja: ポッドキャストのように、Swift Playgroundsの中のサブスクリプションは学習者がある順序で終了する一連の散発的なコンテンツで、理解を深めるためのものですが、幾つかの部分は学習者によっては省略できます。

source: Like shared code folders, the contents of resource folders are shared by the level in the hierarchy at which they are defined and all levels below that.
ja: 共有コードフォルダのように、リソースフォルダの内容は、それでそれらが定義される階層の中のレベルとその下の全てのレベルで共有されます。

source: Line 1 adds support for PlaygroundRemoteLiveViewProxyDelegate as an extension to the MyPlaygroundPageManager class.
ja: 行１は、PlaygroundRemoteLiveViewProxyDelegateに対するサポートをある拡張としてMyPlaygroundPageManagerクラスに加えます。

source: Line 10 sets proxy to a downcast of the current always-on live view.
ja: 行10は、proxyを現在の常時接続ライブビューのダウンキャストに設定します。

source: Line 11 sets myListener to an instance of MyClassThatListens, and line 12 sets the delegate for the proxy to myListener.
ja: 行11は、myListenerをMyClassThatListensのインスタンスに設定します、そして行12はプロキシのための委任先をmyListenerに設定します。

source: Line 13 adds innerView as a subview of liveView.
ja: 行13は、innerViewをliveViewのサブビューとして加えます。

source: Line 2 adds four functions defined in the source of the playground page to the list of possible completions.
ja: 行２は、プレイグラウンドページのソースにおいて定義される４つの関数を可能な補完のリストへと加えます。
